using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;
using System.IO;/*ТІЛЬКИ ЦЯ БІБЛІОТЕКА НАДАЄ ДОСТУП ДО ЗАСОБІВ РОБОТИ З ТЕКСТОВИМИ ФАЙЛАМИ!!! 
Не забувайте додавати її!*/

namespace Cyrillic_Font
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }
        /*Завдання проекту - показати, як створити у Блокноті (NotePad) і зберегти текстовий файл,
         * записаний символами кирилиці - так, щоб він відобразився у listBox без спотворень кириличних літер.
         * Відкриваємо Блокнот, створюємо в ньому новий файл. Раніше шрифт у Блокноті за замовченням був 
         * у форматі ANSI і був у Блокноті пункт головного меню Encoding, де можна було змінити кодування 
         * шрифту на значно більш універсальне UTF-8 (у перекладі - формат перетворення Юнікоду-8 біт).
         * Як я зрозумів із перегляду інформації з інтернету, нині у Блокноті за умовченням встановлено саме
         * UTF-8 кодування символів шрифту. Чи це так - неважко перевірити. Якщо при читанні з файлу 
         * і виведенні його рядків до listBox всі символи такі самі, якими ви їх вводили при запису 
         * до файлу - значить у Блокноті дійсно встановлено код UTF-8, який застосовує кодування 
         * змінної ширини. При цьому коди різної довжини застосовуються для кодування символів 
         * для їх представлення у комп'ютері.
         * НАГАДУЮ! Для доступу до текстового файлу у програмі його слід зберегти у папці Bin/Debug проєкту!
         * Пункт головного меню Encoding є у прикладному пакеті NotePad++ - можливо, ви з ним знайомі.
         * Його легко витягнути з інтернету. Для зміни кодування шрифту у Encoding є пункт підменю Convert to UTF8.
 * .      Якби текст файлу, набраний кирилицею у Блокноті, зберігся у старому кодуванні ANSI, він би був 
          зображений у listBox незрозумілими символами.
          Файл Cyrillic.txt, представлений у даному проекті, набрано у старій версії Блокноту і збережено 
          у кодуванні UTF8. Запустивши ши цей проект на виконання, побачите, що 
          текст, набраний шрифтом кирилиці, так само, без спотворень, відобразиться у listBox.*/
        private void button1_Click(object sender, EventArgs e)
        {
            int i;
            string[] sout;
            string filename, s1;
            filename = textBox1.Text;//Слід ввести ім'я та розширення файлу до textBox.
            s1 = Path.GetFullPath(filename);/*ЦЯ КОМАНДА НАДАЄ ДОСТУП ДО ФАЙЛУ ЗА ЙОГО ІМ'ЯМ ТА РОЗШИРЕННЯМ!
            Спробуйте закоментувати рядок із читанням із textBox1 і перевірити, чи буде при цьому прочитано 
            текст із файлу!*/
            listBox1.Items.Clear();
            sout=File.ReadAllLines(s1);
            for (i = 0; i < sout.Length; i++)
                listBox1.Items.Add(sout[i]);
        }

        private void button2_Click(object sender, EventArgs e)
        {
            Application.Exit();
        }
    }
    }

